{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 1 Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n",
    "\n",
    "среднюю букву, если число букв в слове нечетное; две средних буквы, если число букв четное.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "красота\n",
      "с\n"
     ]
    }
   ],
   "source": [
    "my_string = str(input())\n",
    "a = len(my_string)\n",
    "b = a/2\n",
    "if len(my_string)%2 == 0:\n",
    "    print(my_string[int(b)-1:int(b)+1])\n",
    "else:\n",
    "    print(my_string[int(b)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "краски\n",
      "ас\n"
     ]
    }
   ],
   "source": [
    "my_string = str(input())\n",
    "a = len(my_string)\n",
    "b = a/2\n",
    "if len(my_string)%2 == 0:\n",
    "    print(my_string[int(b)-1:int(b)+1])\n",
    "else:\n",
    "    print(my_string[int(b)])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 2 Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число: 3\n",
      "Введите число: 4\n",
      "Введите число: 6\n",
      "Введите число: 0\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "sum = 0\n",
    "while True:\n",
    "    num = int(input('Введите число: '))\n",
    "    sum += num\n",
    "    if num == 0:\n",
    "        print(sum)\n",
    "        break"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 3 Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек. Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Идеальная пара: \n",
      "Ira  и  Alex\n",
      "Karina  и  Ben\n",
      "Lena  и  Mark\n",
      "Nastya  и  Peter\n"
     ]
    }
   ],
   "source": [
    "boys = ['Alex', 'Ben', 'Mark', 'Peter']\n",
    "girls = ['Ira', 'Karina', 'Lena', 'Nastya']\n",
    "list(zip(girls, boys))\n",
    "if len(boys) == len(girls):\n",
    "    print('Идеальная пара: ')\n",
    "    for boy, girl in zip(girls, boys):\n",
    "        print(boy, ' и ', girl)\n",
    "else:\n",
    "    print('Внимание, кто-то может остаться без пары!')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Внимание, кто-то может остаться без пары!\n"
     ]
    }
   ],
   "source": [
    "boys = ['Alex', 'Ben', 'Mark', 'Peter']\n",
    "girls = ['Ira', 'Karina', 'Lena', 'Nastya', 'Trisha']\n",
    "list(zip(girls, boys))\n",
    "if len(boys) == len(girls):\n",
    "    print('Идеальная пара: ')\n",
    "    for boy, girl in zip(girls, boys):\n",
    "        print(boy, ' и ', girl)\n",
    "else:\n",
    "    print('Внимание, кто-то может остаться без пары!')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задание 4 У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны. Формулаперевода (Ф - 32) * 5/9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Средняя температура в странах: \n",
      "\n",
      "Thailand average temperature 24 C \n",
      "\n",
      "Germany average temperature 14 C \n",
      "\n",
      "Russia average temperature 4 C \n",
      "\n",
      "Poland average temperature 12 C \n",
      "\n"
     ]
    }
   ],
   "source": [
    "countries_temperature = [\n",
    "['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n",
    "['Germany', [57.2, 55.4, 59, 59, 53.6]],\n",
    "['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n",
    "['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n",
    "]\n",
    "print('Средняя температура в странах:', '\\n')\n",
    "for country in countries_temperature:\n",
    "    print(country[0], 'average temperature', (round(((sum(country[1]))/(len(country[1]))-32)*5/9)), 'C', '\\n')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
